Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Executando terraform plan


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_autoscaling_group.atlantis_ecs has changed
~ resource "aws_autoscaling_group" "atlantis_ecs" {
        id                        = "atlantis_ecs"
        name                      = "atlantis_ecs"
      ~ target_group_arns         = [
          + "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/3efdda83734360cb",
        ]
        # (22 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # aws_autoscaling_group.atlantis_ecs will be updated in-place
~ resource "aws_autoscaling_group" "atlantis_ecs" {
        id                        = "atlantis_ecs"
        name                      = "atlantis_ecs"
      ~ target_group_arns         = [
          - "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/3efdda83734360cb",
        ]
        # (22 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_launch_configuration.ubuntu will be created
+ resource "aws_launch_configuration" "ubuntu" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-0fb653ca2d3203ac1"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = "atlantis_ecs"
      + name_prefix                 = (known after apply)
      + user_data                   = "8428bcb25ea4644ae5badd4df1cfb7e662176f98"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_launch_configuration.ubuntu_20_04 will be destroyed
  # (because aws_launch_configuration.ubuntu_20_04 is not in configuration)
- resource "aws_launch_configuration" "ubuntu_20_04" {
      - arn                              = "arn:aws:autoscaling:us-east-2:398963803929:launchConfiguration:71b79a0b-602f-48e5-b098-ce0909d5979c:launchConfigurationName/atlantis_ecs" -> null
      - associate_public_ip_address      = false -> null
      - ebs_optimized                    = false -> null
      - enable_monitoring                = true -> null
      - id                               = "atlantis_ecs" -> null
      - image_id                         = "ami-0fb653ca2d3203ac1" -> null
      - instance_type                    = "t2.micro" -> null
      - name                             = "atlantis_ecs" -> null
      - security_groups                  = [] -> null
      - vpc_classic_link_security_groups = [] -> null
    }

Plan: 1 to add, 1 to change, 1 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://66992d035d8e:4141/lock?id=Matheus-SCosta%252FATLANTIS-ECS%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 1 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
